99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_action/esp32_mquickjs_wifi_action_sdk.c
#include "esp32_mquickjs_wifi_action_sdk.h"
#if CONFIG_ESP32_MQUICKJS_FEATURE_WIFI
#include <stddef.h>
#include <stdint.h>
#include <string.h>
#include "esp32_mquickjs_wifi_twt_sdk.h"
#include "esp32_mquickjs_wifi_twt_information.h"
#include "esp32_mquickjs_wifi_nan_usd_sdk.h"
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
#include "esp32_mquickjs_wifi_nan_ndp.h"
#define ACTION_SDK_NAN_RELEASE_TYPE ((wifi_action_tx_t)(INT32_MAX - 10))
typedef struct {
    wifi_action_tx_req_t request;
    uint32_t identity;
    esp32_mquickjs_wifi_nan_ndp_status_t result;
} action_sdk_nan_release_t;
#endif
#if CONFIG_ESP_WIFI_DPP_SUPPORT
#include "esp32_mquickjs_wifi_dpp_result.h"
#endif

/* Exact fff9895c82 C3/S3/C5 archive layout, verified by the build-local SDK
 * archive hash gate in patch_idf_vendor_ie_context.cmake. Do not generalize to
 * an unreviewed SDK. The wrappers run in the native ioctl execution context,
 * immediately before cancellation, not on the JS/default event-loop task. */
_Static_assert(sizeof(void *) == 4, "reviewed SDK ioctl pointer width");
_Static_assert(offsetof(wifi_action_tx_req_t, rx_cb) == 32 &&
    offsetof(wifi_action_tx_req_t, op_id) == 36 && sizeof(wifi_action_tx_req_t) == 48, "reviewed Action request layout");
_Static_assert(offsetof(wifi_roc_req_t, rx_cb) == 20 &&
    offsetof(wifi_roc_req_t, op_id) == 24 && offsetof(wifi_roc_req_t, done_cb) == 28 &&
    sizeof(wifi_roc_req_t) == 36, "reviewed ROC request layout");
#define ACTION_SDK_FENCE_TYPE ((wifi_action_tx_t)INT32_MAX)
#define ACTION_SDK_QUIESCENT_TYPE ((wifi_action_tx_t)(INT32_MAX - 1))
#define ACTION_SDK_SAVED_PHY_TYPE ((wifi_action_tx_t)(INT32_MAX - 2))
#if CONFIG_SOC_WIFI_HE_SUPPORT
#define ACTION_SDK_TWT_SNAPSHOT_TYPE ((wifi_action_tx_t)(INT32_MAX - 3))
#define ACTION_SDK_TWT_PROBE_CANCEL_TYPE ((wifi_action_tx_t)(INT32_MAX - 4))
typedef struct {
    wifi_action_tx_req_t request;
    esp32_mquickjs_wifi_twt_sdk_snapshot_t result;
} action_sdk_twt_request_t;
typedef struct {
    wifi_action_tx_req_t request;
    uint32_t identity;
} action_sdk_twt_probe_cancel_request_t;
#if CONFIG_IDF_TARGET_ESP32C5
#define ACTION_SDK_TWT_PROBE_CONTROL_TYPE ((wifi_action_tx_t)(INT32_MAX - 5))
#define ACTION_SDK_TWT_SETUP_CANCEL_TYPE ((wifi_action_tx_t)(INT32_MAX - 6))
#define ACTION_SDK_TWT_SETUP_CONTROL_TYPE ((wifi_action_tx_t)(INT32_MAX - 7))
#define ACTION_SDK_TWT_BROADCAST_SNAPSHOT_TYPE ((wifi_action_tx_t)(INT32_MAX - 8))
#define ACTION_SDK_BTWT_CONTROL_TYPE ((wifi_action_tx_t)(INT32_MAX - 9))
enum { BTWT_CANCEL, BTWT_QUIESCENT, BTWT_RELEASE, BTWT_TEARDOWN };
typedef struct {
    wifi_action_tx_req_t request;
    uint32_t command, slot, identity, sequence;
    esp32_mquickjs_wifi_btwt_cut_t cut;
} action_sdk_btwt_control_t;
typedef struct {
    wifi_action_tx_req_t request;
    esp32_mquickjs_wifi_twt_broadcast_snapshot_t result;
} action_sdk_twt_broadcast_request_t;
enum { TWT_SETUP_QUIESCENT, TWT_SETUP_RELEASE, TWT_SETUP_TEARDOWN, TWT_TEARDOWN_TX_QUIESCENT,
    TWT_TEARDOWN_TX_RELEASE, TWT_INFORMATION_SUBMIT, TWT_INFORMATION_REAP, TWT_INFORMATION_RESUME };
typedef struct {
    wifi_action_tx_req_t request;
    uint32_t command, identity, sequence, flow;
    esp32_mquickjs_wifi_twt_setup_cut_t cut;
} action_sdk_twt_setup_control_t;
enum { TWT_PROBE_SUBMIT, TWT_PROBE_QUIESCENT, TWT_PROBE_RELEASE };
typedef struct {
    wifi_action_tx_req_t request;
    uint32_t command, identity, timeout_ms, sequence;
    esp32_mquickjs_wifi_twt_probe_cut_t cut;
} action_sdk_twt_probe_control_t;
#endif
#endif
extern uint8_t g_offchan_ctx[28];
esp_err_t __real_wifi_action_tx_process(void *message);
esp_err_t __real_wifi_roc_process(void *message);
#if CONFIG_IDF_TARGET_ESP32C5
_Static_assert(sizeof(wifi_protocols_t) == 4 && offsetof(wifi_protocols_t, ghz_5g) == 2 &&
    sizeof(wifi_bandwidth_t) == 4 && sizeof(wifi_bandwidths_t) == 8 &&
    offsetof(wifi_bandwidths_t, ghz_5g) == 4, "reviewed C5 saved PHY output widths");
/* The reviewed handlers read byte 8 (ifx), word 12 (2g output), word 20
 * (5g output). Unlike the public wrappers they do not filter by band mode.
 * They read saved SDK policy and only write the supplied output spans. */
typedef struct {
    uint8_t prefix[8], interface, reserved[3];
    void *ghz_2g;
    uint32_t unused;
    void *ghz_5g;
} action_sdk_phy_message_t;
_Static_assert(offsetof(action_sdk_phy_message_t, interface) == 8 &&
    offsetof(action_sdk_phy_message_t, ghz_2g) == 12 && offsetof(action_sdk_phy_message_t, ghz_5g) == 20 &&
    sizeof(action_sdk_phy_message_t) == 24, "reviewed C5 saved PHY ioctl layout");
/* Like the existing Action options capture, this embeds the native variable-tail
 * request in private fixed-size storage. It is never submitted as an RF frame. */
typedef struct {
    wifi_action_tx_req_t request;
    esp32_mquickjs_wifi_saved_phy_t result;
} action_sdk_phy_request_t;
esp_err_t wifi_get_protocols_process(void *message);
esp_err_t wifi_get_bw_process(void *message);

static esp_err_t action_sdk_saved_phy_process(action_sdk_phy_request_t *request)
{
    if (request->request.ifx != WIFI_IF_STA && request->request.ifx != WIFI_IF_AP) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (request->request.ifx == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
    esp32_mquickjs_wifi_saved_phy_t result = {0};
    action_sdk_phy_message_t message = {.interface = (uint8_t)request->request.ifx,
        .ghz_2g = &result.protocols.ghz_2g, .ghz_5g = &result.protocols.ghz_5g};
    esp_err_t err = wifi_get_protocols_process(&message);
    if (err != ESP_OK) return err;
    message.ghz_2g = &result.bandwidths.ghz_2g;
    message.ghz_5g = &result.bandwidths.ghz_5g;
    err = wifi_get_bw_process(&message);
    if (err == ESP_OK) request->result = result;
    return err;
}
#endif


int esp32_mquickjs_wifi_action_receive(uint8_t *header, uint8_t *payload, size_t length, uint8_t channel)
{
    (void)header; (void)payload; (void)length; (void)channel;
    return 0;
}

static bool action_sdk_owner(wifi_action_rx_cb_t callback, wifi_interface_t interface,
    uint8_t channel, wifi_second_chan_t secondary, uint8_t operation_id)
{
    uint32_t current_context, current_interface, current_secondary;
    memcpy(&current_context, g_offchan_ctx + 4, sizeof(current_context));
    memcpy(&current_interface, g_offchan_ctx + 8, sizeof(current_interface));
    memcpy(&current_secondary, g_offchan_ctx + 20, sizeof(current_secondary));
    return current_context == (uint32_t)(uintptr_t)callback && current_interface == (uint32_t)interface &&
        g_offchan_ctx[2] == channel && current_secondary == (uint32_t)secondary && g_offchan_ctx[12] == operation_id;
}

