99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_action/esp32_mquickjs_wifi_action_sdk.c
static bool action_sdk_guarded_callback(wifi_action_rx_cb_t callback)
{
    if (callback == esp32_mquickjs_wifi_action_receive) return true;
#if CONFIG_ESP_WIFI_DPP_SUPPORT
    if (esp32qjs_dpp_is_action_callback((uintptr_t)callback)) return true;
#endif
#if CONFIG_ESP_WIFI_NAN_USD_ENABLE
    if (esp32qjs_nan_usd_is_action_callback((uintptr_t)callback)) return true;
#endif
    return false;
}

esp_err_t __wrap_wifi_action_tx_process(void *message)
{
    wifi_action_tx_req_t *request;
    if (message == NULL) return ESP_ERR_INVALID_ARG;
    memcpy(&request, (const uint8_t *)message + 20, sizeof(request));
    if (request == NULL) return ESP_ERR_INVALID_ARG;
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
    if (request->type == ACTION_SDK_NAN_RELEASE_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_NAN) return ESP_ERR_INVALID_ARG;
        action_sdk_nan_release_t *release = (action_sdk_nan_release_t *)request;
        return esp32_mquickjs_wifi_nan_sdk_ndp_release_native(release->identity, &release->result);
    }
#endif
#if CONFIG_SOC_WIFI_HE_SUPPORT && CONFIG_IDF_TARGET_ESP32C5
    if (request->type == ACTION_SDK_BTWT_CONTROL_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        action_sdk_btwt_control_t *control = (action_sdk_btwt_control_t *)request;
        if (control->command == BTWT_TEARDOWN)
            return esp32_mquickjs_wifi_twt_sdk_broadcast_teardown_native(control->slot, control->identity);
        if (control->command == BTWT_CANCEL)
            return esp32_mquickjs_wifi_btwt_setup_cancel_native(control->slot, control->identity);
        if (control->command == BTWT_QUIESCENT)
            return esp32_mquickjs_wifi_btwt_setup_quiescent_native(control->slot, control->identity, &control->cut);
        if (control->command == BTWT_RELEASE)
            return esp32_mquickjs_wifi_btwt_setup_release_native(control->slot, control->identity, &control->cut, control->sequence);
        return ESP_ERR_INVALID_ARG;
    }
    if (request->type == ACTION_SDK_TWT_BROADCAST_SNAPSHOT_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        return esp32_mquickjs_wifi_twt_sdk_broadcast_snapshot_native(&((action_sdk_twt_broadcast_request_t *)request)->result);
    }
    if (request->type == ACTION_SDK_TWT_SETUP_CONTROL_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        action_sdk_twt_setup_control_t *control = (action_sdk_twt_setup_control_t *)request;
        if (control->command == TWT_INFORMATION_SUBMIT || control->command == TWT_INFORMATION_RESUME)
            return esp32_mquickjs_wifi_twt_sdk_information_submit_native(control->identity, control->flow,
                control->command == TWT_INFORMATION_RESUME, &control->sequence);
        if (control->command == TWT_INFORMATION_REAP)
            return esp32_mquickjs_wifi_twt_information_reap_native(control->identity);
        if (control->command == TWT_SETUP_QUIESCENT)
            return esp32_mquickjs_wifi_twt_sdk_setup_quiescent_native(control->identity, &control->cut);
        if (control->command == TWT_SETUP_RELEASE)
            return esp32_mquickjs_wifi_twt_sdk_setup_release_native(control->identity, &control->cut, control->sequence);
        if (control->command == TWT_SETUP_TEARDOWN) {
            if (control->flow > 7U) return ESP_ERR_INVALID_ARG;
            return esp32_mquickjs_wifi_twt_sdk_setup_teardown_native(control->identity, (uint8_t)control->flow);
        }
        if (control->command == TWT_TEARDOWN_TX_QUIESCENT)
            return esp32_mquickjs_wifi_twt_teardown_tx_quiescent_native(control->identity, &control->sequence);
        if (control->command == TWT_TEARDOWN_TX_RELEASE)
            return esp32_mquickjs_wifi_twt_teardown_tx_release_native(control->identity, control->sequence)
                ? ESP_OK : ESP_ERR_NOT_FINISHED;
        return ESP_ERR_INVALID_ARG;
    }
    if (request->type == ACTION_SDK_TWT_SETUP_CANCEL_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        return esp32_mquickjs_wifi_twt_sdk_setup_cancel_native(((action_sdk_twt_probe_cancel_request_t *)request)->identity);
    }
    if (request->type == ACTION_SDK_TWT_PROBE_CONTROL_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        action_sdk_twt_probe_control_t *control = (action_sdk_twt_probe_control_t *)request;
        if (control->command == TWT_PROBE_SUBMIT)
            return esp32_mquickjs_wifi_twt_sdk_probe_submit_native(control->timeout_ms, &control->identity);
        if (control->command == TWT_PROBE_QUIESCENT)
            return esp32_mquickjs_wifi_twt_sdk_probe_quiescent_native(control->identity, &control->cut);
        if (control->command == TWT_PROBE_RELEASE)
            return esp32_mquickjs_wifi_twt_sdk_probe_release_native(control->identity, &control->cut, control->sequence);
        return ESP_ERR_INVALID_ARG;
    }
    if (request->type == ACTION_SDK_TWT_PROBE_CANCEL_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        if (request->ifx != WIFI_IF_STA) return ESP_ERR_INVALID_ARG;
        return esp32_mquickjs_wifi_twt_sdk_probe_cancel_native(((action_sdk_twt_probe_cancel_request_t *)request)->identity);
    }
    if (request->type == ACTION_SDK_TWT_SNAPSHOT_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive)
        return esp32_mquickjs_wifi_twt_sdk_snapshot_native(&((action_sdk_twt_request_t *)request)->result);
#endif
#if CONFIG_IDF_TARGET_ESP32C5
    if (request->type == ACTION_SDK_SAVED_PHY_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive)
        return action_sdk_saved_phy_process((action_sdk_phy_request_t *)request);
#endif
    if (request->type == ACTION_SDK_FENCE_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) return ESP_OK;
    if (request->type == ACTION_SDK_QUIESCENT_TYPE && request->rx_cb == esp32_mquickjs_wifi_action_receive) {
        /* Reviewed C3/S3/C5 end/failure paths clear all 28 bytes after native
         * release. Queue serialization excludes transient memset during submit.
         * A foreign/nonzero record is not evidence our resources are retired. */
        uint8_t present = 0;
        for (size_t i = 0; i < sizeof(g_offchan_ctx); ++i) present |= g_offchan_ctx[i];
        return present ? ESP_ERR_TIMEOUT : ESP_OK;
    }
    if (request->type == WIFI_OFFCHAN_TX_CANCEL && action_sdk_guarded_callback(request->rx_cb) &&
        !action_sdk_owner(request->rx_cb, request->ifx, request->channel, request->sec_channel, request->op_id))
        return ESP_ERR_INVALID_STATE;
    /* Other modules retain their native behavior. The SDK still checks the
     * current channel-manager operation kind before chm_cancel_op(). */
    return __real_wifi_action_tx_process(message);
}

esp_err_t __wrap_wifi_roc_process(void *message)
{
    wifi_roc_req_t *request;
    if (message == NULL) return ESP_ERR_INVALID_ARG;
    memcpy(&request, (const uint8_t *)message + 20, sizeof(request));
    if (request == NULL) return ESP_ERR_INVALID_ARG;
    if (request->type == WIFI_ROC_CANCEL && action_sdk_guarded_callback(request->rx_cb) &&
        !action_sdk_owner(request->rx_cb, request->ifx, request->channel, request->sec_channel, request->op_id))
        return ESP_ERR_INVALID_STATE;
    return __real_wifi_roc_process(message);
}
esp_err_t esp32_mquickjs_wifi_action_sdk_fence(void)
{
    wifi_action_tx_req_t request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_FENCE_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive,
    };
    /* The API wrapper validates ifx, then dispatches to our native ioctl shim.
     * No global-record read or driver mutation occurs in the sentinel branch. */
    return esp_wifi_action_tx_req(&request);
}

