99percentpeople/esp32qjs/components/esp32_mquickjs/src/modules/wifi_action/esp32_mquickjs_wifi_action_sdk.c
#if CONFIG_ESP_WIFI_NAN_SYNC_ENABLE
esp_err_t esp32_mquickjs_wifi_nan_sdk_ndp_release(uint32_t identity,
    esp32_mquickjs_wifi_nan_ndp_status_t *status)
{
    if (!identity || !status) return ESP_ERR_INVALID_ARG;
    action_sdk_nan_release_t request = {.request = {.ifx = WIFI_IF_NAN,
        .type = ACTION_SDK_NAN_RELEASE_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .identity = identity};
    /* The pinned API validates initialization and interface, then invokes
     * our shim synchronously on the Wi-Fi task. No RF Action is submitted. */
    esp_err_t error = esp_wifi_action_tx_req(&request.request);
    if (error == ESP_OK) *status = request.result;
    return error;
}
#endif

esp_err_t esp32_mquickjs_wifi_action_sdk_quiescent(void)
{
    wifi_action_tx_req_t request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_QUIESCENT_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive,
    };
    return esp_wifi_action_tx_req(&request);
}

esp_err_t esp32_mquickjs_wifi_action_sdk_saved_phy(wifi_interface_t interface,
    esp32_mquickjs_wifi_saved_phy_t *output)
{
    if (output == NULL || (interface != WIFI_IF_STA && interface != WIFI_IF_AP)) return ESP_ERR_INVALID_ARG;
#if !CONFIG_ESP_WIFI_SOFTAP_SUPPORT
    if (interface == WIFI_IF_AP) return ESP_ERR_NOT_SUPPORTED;
#endif
#if CONFIG_IDF_TARGET_ESP32C5
    action_sdk_phy_request_t request = {.request = {
        .ifx = interface, .type = ACTION_SDK_SAVED_PHY_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive}};
    esp_err_t err = esp_wifi_action_tx_req(&request.request);
    if (err == ESP_OK) *output = request.result;
    return err;
#else
    return ESP_ERR_NOT_SUPPORTED;
#endif
}

#if CONFIG_SOC_WIFI_HE_SUPPORT
#if CONFIG_IDF_TARGET_ESP32C5
static action_sdk_twt_probe_control_t action_sdk_probe_control(unsigned command, uint32_t identity)
{
    return (action_sdk_twt_probe_control_t){.request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_TWT_PROBE_CONTROL_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive}, .command = command, .identity = identity};
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_submit(uint32_t timeout_ms, uint32_t *identity)
{
    if (identity == NULL || *identity != 0U || timeout_ms == 0U || timeout_ms > 60000U) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_probe_control_t control = action_sdk_probe_control(TWT_PROBE_SUBMIT, 0);
    control.timeout_ms = timeout_ms;
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    /* Accepted native storage must be returned even if submission failed. */
    if (control.identity != 0U) *identity = control.identity;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_quiescent(uint32_t identity, esp32_mquickjs_wifi_twt_probe_cut_t *cut)
{
    if (identity == 0U || cut == NULL) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_probe_control_t control = action_sdk_probe_control(TWT_PROBE_QUIESCENT, identity);
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    if (error == ESP_OK) *cut = control.cut;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_release(uint32_t identity,
    const esp32_mquickjs_wifi_twt_probe_cut_t *cut, uint32_t sequence)
{
    if (identity == 0U || cut == NULL || sequence == 0U) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_probe_control_t control = action_sdk_probe_control(TWT_PROBE_RELEASE, identity);
    control.cut = *cut;
    control.sequence = sequence;
    return esp_wifi_action_tx_req(&control.request);
}
#endif
esp_err_t esp32_mquickjs_wifi_twt_sdk_probe_cancel(uint32_t identity)
{
    if (identity == 0U) return ESP_ERR_INVALID_ARG;
#if CONFIG_IDF_TARGET_ESP32C5
    action_sdk_twt_probe_cancel_request_t request = {.request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_TWT_PROBE_CANCEL_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive}, .identity = identity};
    return esp_wifi_action_tx_req(&request.request);
#else
    return ESP_ERR_NOT_SUPPORTED;
#endif
}
#if CONFIG_IDF_TARGET_ESP32C5
esp_err_t esp32_mquickjs_wifi_twt_sdk_broadcast_teardown(unsigned slot, uint32_t identity)
{
    if (slot >= 32 || !identity) return ESP_ERR_INVALID_ARG;
    action_sdk_btwt_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_BTWT_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = BTWT_TEARDOWN, .slot = slot, .identity = identity};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_broadcast_cancel(unsigned slot, uint32_t identity)
{
    if (slot >= 32 || !identity) return ESP_ERR_INVALID_ARG;
    action_sdk_btwt_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_BTWT_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = BTWT_CANCEL, .slot = slot, .identity = identity};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_broadcast_quiescent(unsigned slot, uint32_t identity, esp32_mquickjs_wifi_btwt_cut_t *out)
{
    if (slot >= 32 || !identity || out == NULL) return ESP_ERR_INVALID_ARG;
    action_sdk_btwt_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_BTWT_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = BTWT_QUIESCENT, .slot = slot, .identity = identity};
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    if (error == ESP_OK) *out = control.cut;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_broadcast_release(unsigned slot, uint32_t identity,
    const esp32_mquickjs_wifi_btwt_cut_t *cut, uint32_t sequence)
{
    if (slot >= 32 || !identity || cut == NULL || !sequence) return ESP_ERR_INVALID_ARG;
    action_sdk_btwt_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_BTWT_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = BTWT_RELEASE, .slot = slot, .identity = identity, .sequence = sequence, .cut = *cut};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_cancel(uint32_t identity)
{
    if (identity == 0U) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_probe_cancel_request_t request = {.request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_TWT_SETUP_CANCEL_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive}, .identity = identity};
    return esp_wifi_action_tx_req(&request.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_quiescent(uint32_t identity, esp32_mquickjs_wifi_twt_setup_cut_t *cut)
{
    if (identity == 0U || cut == NULL) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_SETUP_QUIESCENT, .identity = identity};
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    if (error == ESP_OK) *cut = control.cut;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_teardown(uint32_t identity, uint8_t flow)
{
    if (identity == 0U || flow > 7U) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_SETUP_TEARDOWN, .identity = identity, .flow = flow};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_information_submit(uint32_t setup_identity, uint32_t duration_ms, bool resume, uint32_t *identity)
{
    if (!setup_identity || identity == NULL || (resume && duration_ms) || duration_ms > ESP32_MQUICKJS_WIFI_TWT_SUSPEND_MAX_MS)
        return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = resume ? TWT_INFORMATION_RESUME : TWT_INFORMATION_SUBMIT, .identity = setup_identity, .flow = duration_ms};
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    *identity = control.sequence; /* Accepted native failures still retain their operation. */
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_information_reap(uint32_t setup_identity)
{
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_INFORMATION_REAP, .identity = setup_identity};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_teardown_tx_quiescent(uint32_t identity, uint32_t *revision)
{
    if (identity == 0U || revision == NULL) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_TEARDOWN_TX_QUIESCENT, .identity = identity};
    esp_err_t error = esp_wifi_action_tx_req(&control.request);
    if (error == ESP_OK) *revision = control.sequence;
    return error;
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_teardown_tx_release(uint32_t identity, uint32_t revision)
{
    if (identity == 0U || revision == 0U || revision == UINT32_MAX) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_TEARDOWN_TX_RELEASE, .identity = identity, .sequence = revision};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_setup_release(uint32_t identity,
    const esp32_mquickjs_wifi_twt_setup_cut_t *cut, uint32_t sequence)
{
    if (identity == 0U || cut == NULL || sequence == 0U) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_setup_control_t control = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_SETUP_CONTROL_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive},
        .command = TWT_SETUP_RELEASE, .identity = identity, .sequence = sequence, .cut = *cut};
    return esp_wifi_action_tx_req(&control.request);
}
esp_err_t esp32_mquickjs_wifi_twt_sdk_broadcast_snapshot(esp32_mquickjs_wifi_twt_broadcast_snapshot_t *output)
{
    if (output == NULL) return ESP_ERR_INVALID_ARG;
    action_sdk_twt_broadcast_request_t request = {.request = {.ifx = WIFI_IF_STA,
        .type = ACTION_SDK_TWT_BROADCAST_SNAPSHOT_TYPE, .rx_cb = esp32_mquickjs_wifi_action_receive}};
    esp_err_t error = esp_wifi_action_tx_req(&request.request);
    if (error == ESP_OK) *output = request.result;
    return error;
}
#endif

esp_err_t esp32_mquickjs_wifi_twt_sdk_snapshot(esp32_mquickjs_wifi_twt_sdk_snapshot_t *output)
{
    if (output == NULL) return ESP_ERR_INVALID_ARG;
#if CONFIG_IDF_TARGET_ESP32C5
    action_sdk_twt_request_t request = {.request = {
        .ifx = WIFI_IF_STA, .type = ACTION_SDK_TWT_SNAPSHOT_TYPE,
        .rx_cb = esp32_mquickjs_wifi_action_receive}};
    esp_err_t error = esp_wifi_action_tx_req(&request.request);
    if (error == ESP_OK) *output = request.result;
    return error;
#else
    return ESP_ERR_NOT_SUPPORTED;
#endif
}
#endif

#endif
